In [1]:
import os
import pandas as pd
image_list = os.listdir('./train')
label = pd.read_csv('trainLabels.csv')

In [10]:
num_list = []
for i in image_list:
#     print(i.split('_')[0])
    num = i.split('_')[0]
    if num not in num_list:
        num_list.append(num)

In [11]:
len(num_list)
# it mean we got 9162 photos

9162

In [23]:
import numpy as np
count = 0
new_list = []
for i in label.values:
    if i[0].split('_')[0] in num_list:
        new_list.append(i)
        count +=1

In [25]:
data = pd.DataFrame(new_list)
data.head()

          0  1
0   30_left  1
1  30_right  2
2   31_left  0
3  31_right  0
4   33_left  0

In [27]:
data.columns = ['image','level']
data.head()

      image  level
0   30_left      1
1  30_right      2
2   31_left      0
3  31_right      0
4   33_left      0

In [29]:
data.to_csv('new_label.csv',index=False)

In [30]:
df = pd.read_csv('new_label.csv')
df

             image  level
0          30_left      1
1         30_right      2
2          31_left      0
3         31_right      0
4          33_left      0
...            ...    ...
18319  44347_right      0
18320   44348_left      0
18321  44348_right      0
18322   44349_left      0
18323  44349_right      1

[18324 rows x 2 columns]